cmsis-svd/cmsis-svd/data/Microchip/ATSAMG55J.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>FLEXCOM0</name>
         <version>11277A</version>
         <description>Flexible Serial Communication</description>
         <groupName>FLEXCOM</groupName>
         <prependToName>FLEXCOM_</prependToName>
         <baseAddress>0x4000C000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x24</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>FLEXCOM0</name>
            <value>8</value>
         </interrupt>
         <registers>
            <register>
               <name>FLEXCOM_MR</name>
               <description>FLEXCOM Mode register</description>
               <addressOffset>0x0000</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>OPMODE</name>
                     <description>FLEXCOM Operating Mode</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>OPMODESelect</name>
                        <enumeratedValue>
                           <name>NO_COM</name>
                           <description>No communication</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USART</name>
                           <description>All related USART related protocols are selected (RS232, RS485, IrDA, ISO7816, LIN,)All SPI/TWI related registers are not accessible and have no impact on IOs.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SPI</name>
                           <description>SPI operating mode is selected.All USART/TWI related registers are not accessible and have no impact on IOs.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>TWI</name>
                           <description>All related TWI protocols are selected (TWI, SMBUS). All USART/SPI related registers are not accessible and have no impact on IOs.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEXCOM_RHR</name>
               <description>FLEXCOM Receive Holding Register</description>
               <addressOffset>0x0010</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXDATA</name>
                     <description>Receive Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>FLEXCOM_THR</name>
               <description>FLEXCOM Transmit Holding Register</description>
               <addressOffset>0x0020</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXDATA</name>
                     <description>Transmit Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM1</name>
         <baseAddress>0x40020000</baseAddress>
         <interrupt>
            <name>FLEXCOM1</name>
            <value>9</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM2</name>
         <baseAddress>0x40024000</baseAddress>
         <interrupt>
            <name>FLEXCOM2</name>
            <value>14</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM3</name>
         <baseAddress>0x40018000</baseAddress>
         <interrupt>
            <name>FLEXCOM3</name>
            <value>19</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM4</name>
         <baseAddress>0x4001C000</baseAddress>
         <interrupt>
            <name>FLEXCOM4</name>
            <value>20</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM5</name>
         <baseAddress>0x40008000</baseAddress>
         <interrupt>
            <name>FLEXCOM5</name>
            <value>21</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM6</name>
         <baseAddress>0x40040000</baseAddress>
         <interrupt>
            <name>FLEXCOM6</name>
            <value>22</value>
         </interrupt>
      </peripheral>
      <peripheral derivedFrom="FLEXCOM0">
         <name>FLEXCOM7</name>
         <baseAddress>0x40034000</baseAddress>
         <interrupt>
            <name>FLEXCOM7</name>
            <value>7</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>GPBR</name>
         <version>6378G</version>
         <description>General Purpose Backup Registers</description>
         <groupName>GPBR</groupName>
         <prependToName>GPBR_</prependToName>
         <baseAddress>0x400E1490</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x20</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>8</dim>
               <dimIncrement>4</dimIncrement>
               <name>SYS_GPBR[%s]</name>
               <description>General Purpose Backup Register 0</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GPBR_VALUE</name>
                     <description>Value of GPBR x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
