cmsis-svd/cmsis-svd/data/Microchip/ATSAMG55J.svd
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE27Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE28</name>
                     <description>Drive of Line 28</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE28Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE29</name>
                     <description>Drive of Line 29</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE29Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE30</name>
                     <description>Drive of Line 30</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE30Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LINE31</name>
                     <description>Drive of Line 31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LINE31Select</name>
                        <enumeratedValue>
                           <name>LOW_DRIVE</name>
                           <description>Lowest drive</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>HIGH_DRIVE</name>
                           <description>Highest drive</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral derivedFrom="PIOA">
         <name>PIOB</name>
         <baseAddress>0x400E1000</baseAddress>
         <interrupt>
            <name>PIOB</name>
            <value>12</value>
         </interrupt>
      </peripheral>
      <peripheral>
         <name>PMC</name>
         <version>11116V</version>
         <description>Power Management Controller</description>
         <groupName>PMC</groupName>
         <prependToName>PMC_</prependToName>
         <baseAddress>0x400E0400</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x134</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PMC</name>
            <value>5</value>
         </interrupt>
         <registers>
            <register>
               <name>PMC_SCER</name>
               <description>System Clock Enable Register</description>
               <addressOffset>0x0000</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>UHP</name>
                     <description>USB Host Port Clock Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDP</name>
                     <description>USB Device Port Clock Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK0</name>
                     <description>Programmable Clock 0 Output Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK1</name>
                     <description>Programmable Clock 1 Output Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK2</name>
                     <description>Programmable Clock 2 Output Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK3</name>
                     <description>Programmable Clock 3 Output Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK4</name>
                     <description>Programmable Clock 4 Output Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK5</name>
                     <description>Programmable Clock 5 Output Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK6</name>
                     <description>Programmable Clock 6 Output Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK7</name>
                     <description>Programmable Clock 7 Output Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMC_SCDR</name>
               <description>System Clock Disable Register</description>
               <addressOffset>0x0004</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>UHP</name>
                     <description>USB Host Port Clock Disable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDP</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK0</name>
                     <description>Programmable Clock 0 Output Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK1</name>
                     <description>Programmable Clock 1 Output Disable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK2</name>
                     <description>Programmable Clock 2 Output Disable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK3</name>
                     <description>Programmable Clock 3 Output Disable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK4</name>
                     <description>Programmable Clock 4 Output Disable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK5</name>
                     <description>Programmable Clock 5 Output Disable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK6</name>
                     <description>Programmable Clock 6 Output Disable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK7</name>
                     <description>Programmable Clock 7 Output Disable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMC_SCSR</name>
               <description>System Clock Status Register</description>
               <addressOffset>0x0008</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>UHP</name>
                     <description>USB Host Port Clock Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UDP</name>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK0</name>
                     <description>Programmable Clock 0 Output Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK1</name>
                     <description>Programmable Clock 1 Output Status</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK2</name>
                     <description>Programmable Clock 2 Output Status</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK3</name>
                     <description>Programmable Clock 3 Output Status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK4</name>
                     <description>Programmable Clock 4 Output Status</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK5</name>
                     <description>Programmable Clock 5 Output Status</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK6</name>
                     <description>Programmable Clock 6 Output Status</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PCK7</name>
                     <description>Programmable Clock 7 Output Status</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>PMC_PCER0</name>
               <description>Peripheral Clock Enable Register 0</description>
               <addressOffset>0x0010</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>PID8</name>
                     <description>Peripheral Clock 8 Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID9</name>
                     <description>Peripheral Clock 9 Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID10</name>
                     <description>Peripheral Clock 10 Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID11</name>
                     <description>Peripheral Clock 11 Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID12</name>
                     <description>Peripheral Clock 12 Enable</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID13</name>
                     <description>Peripheral Clock 13 Enable</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID14</name>
                     <description>Peripheral Clock 14 Enable</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID15</name>
                     <description>Peripheral Clock 15 Enable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID16</name>
                     <description>Peripheral Clock 16 Enable</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID17</name>
                     <description>Peripheral Clock 17 Enable</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID18</name>
                     <description>Peripheral Clock 18 Enable</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID19</name>
                     <description>Peripheral Clock 19 Enable</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID20</name>
                     <description>Peripheral Clock 20 Enable</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID21</name>
                     <description>Peripheral Clock 21 Enable</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID22</name>
                     <description>Peripheral Clock 22 Enable</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID23</name>
                     <description>Peripheral Clock 23 Enable</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID24</name>
                     <description>Peripheral Clock 24 Enable</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID25</name>
                     <description>Peripheral Clock 25 Enable</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID26</name>
                     <description>Peripheral Clock 26 Enable</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID27</name>
                     <description>Peripheral Clock 27 Enable</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID28</name>
                     <description>Peripheral Clock 28 Enable</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PID29</name>
                     <description>Peripheral Clock 29 Enable</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
