cmsis-svd/cmsis-svd/data/Microchip/ATSAMG55J.svd
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPIS14</name>
                     <description>WKUP Input Status 14 (cleared on read)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WKUPIS14Select</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WKUPIS15</name>
                     <description>WKUP Input Status 15 (cleared on read)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WKUPIS15Select</name>
                        <enumeratedValue>
                           <name>DISABLED</name>
                           <description>The corresponding wake-up input is disabled, or was inactive at the time the debouncer triggered a wake-up event.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLED</name>
                           <description>The corresponding wake-up input was active at the time the debouncer triggered a wake-up event since the last read of SUPC_SR.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>SUPC_PWMR</name>
               <description>Supply Controller Power Mode Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LPOWERS</name>
                     <description>Low Power Value Selection</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>LPOWERSSelect</name>
                        <enumeratedValue>
                           <name>FACTORY</name>
                           <description>The trimming value applied to the regulator when the device is in Wait mode. This value is factory-defined.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USER</name>
                           <description>The trimming value applied to the regulator is defined by the value programmed in the LPOWERx bits.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>LPOWER0</name>
                     <description>Low Power Value</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPOWER1</name>
                     <description>Low Power Value</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPOWER2</name>
                     <description>Low Power Value</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPOWER3</name>
                     <description>Low Power Value</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STUPTIME</name>
                     <description>Start-up Time when Resuming from Wait Mode</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>STUPTIMESelect</name>
                        <enumeratedValue>
                           <name>FAST</name>
                           <description>Fast start-up.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SLOW</name>
                           <description>Slow start-up.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECPWRS</name>
                     <description>Enhanced Custom Power Value Selection</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ECPWRSSelect</name>
                        <enumeratedValue>
                           <name>FACTORY</name>
                           <description>The trimming value applied to the regulator when the device is in Active mode. This value is factory-defined.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>USER</name>
                           <description>The trimming value applied to the regulator is defined by the value programmed in ECPWRx bits.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECPWR0</name>
                     <description>Enhanced Custom Power Value</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECPWR1</name>
                     <description>Enhanced Custom Power Value</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECPWR2</name>
                     <description>Enhanced Custom Power Value</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ECPWR3</name>
                     <description>Enhanced Custom Power Value</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SRAM0ON</name>
                     <description>SRAM Power Control</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SRAM0ONSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>SRAMx is not powered.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>SRAMx is powered.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRAM1ON</name>
                     <description>SRAM Power Control</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SRAM1ONSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>SRAMx is not powered.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>SRAMx is powered.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRAM2ON</name>
                     <description>SRAM Power Control</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SRAM2ONSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>SRAMx is not powered.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>SRAMx is powered.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRAM3ON</name>
                     <description>SRAM Power Control</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SRAM3ONSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>SRAMx is not powered.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>SRAMx is powered.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRAM4ON</name>
                     <description>SRAM Power Control</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SRAM4ONSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>SRAMx is not powered.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>SRAMx is powered.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRAM5ON</name>
                     <description>SRAM Power Control</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SRAM5ONSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>SRAMx is not powered.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>SRAMx is powered.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SRAM6ON</name>
                     <description>SRAM Power Control</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SRAM6ONSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>SRAMx is not powered.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>SRAMx is powered.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DPRAMON</name>
                     <description>Dual-port RAM Power Control</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>DPRAMONSelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>USB dual-port RAM is not powered.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ON</name>
                           <description>USB dual-port RAM is powered.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>KEY</name>
                     <description>Password Key</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                     <enumeratedValues>
                        <name>KEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation.Always reads as 0.</description>
                           <value>0x5A</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
