cmsis-svd/cmsis-svd/data/Microchip/ATSAMG55J.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="TWI0">
         <name>TWI1</name>
         <baseAddress>0x40020600</baseAddress>
      </peripheral>
      <peripheral derivedFrom="TWI0">
         <name>TWI2</name>
         <baseAddress>0x40024600</baseAddress>
      </peripheral>
      <peripheral derivedFrom="TWI0">
         <name>TWI3</name>
         <baseAddress>0x40018600</baseAddress>
      </peripheral>
      <peripheral derivedFrom="TWI0">
         <name>TWI4</name>
         <baseAddress>0x4001C600</baseAddress>
      </peripheral>
      <peripheral derivedFrom="TWI0">
         <name>TWI5</name>
         <baseAddress>0x40008600</baseAddress>
      </peripheral>
      <peripheral derivedFrom="TWI0">
         <name>TWI6</name>
         <baseAddress>0x40040600</baseAddress>
      </peripheral>
      <peripheral derivedFrom="TWI0">
         <name>TWI7</name>
         <baseAddress>0x40034600</baseAddress>
      </peripheral>
      <peripheral>
         <name>UDP</name>
         <version>6083Y</version>
         <description>USB Device Port</description>
         <groupName>UDP</groupName>
         <prependToName>UDP_</prependToName>
         <baseAddress>0x40044000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x78</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>UDP</name>
            <value>48</value>
         </interrupt>
         <registers>
            <register>
               <name>UDP_FRM_NUM</name>
               <description>Frame Number Register</description>
               <addressOffset>0x000</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FRM_NUM</name>
                     <description>Frame Number as Defined in the Packet Field Formats</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>FRM_ERR</name>
                     <description>Frame Error</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FRM_OK</name>
                     <description>Frame OK</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDP_GLB_STAT</name>
               <description>Global State Register</description>
               <addressOffset>0x004</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FADDEN</name>
                     <description>Function Address Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CONFG</name>
                     <description>Configured</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ESR</name>
                     <description>Enable Send Resume</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RSMINPR</name>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RMWUPE</name>
                     <description>Remote Wakeup Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDP_FADDR</name>
               <description>Function Address Register</description>
               <addressOffset>0x008</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FADD</name>
                     <description>Function Address Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>FEN</name>
                     <description>Function Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDP_IER</name>
               <description>Interrupt Enable Register</description>
               <addressOffset>0x010</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>EP0INT</name>
                     <description>Enable Endpoint 0 Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP1INT</name>
                     <description>Enable Endpoint 1 Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP2INT</name>
                     <description>Enable Endpoint 2Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP3INT</name>
                     <description>Enable Endpoint 3 Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP4INT</name>
                     <description>Enable Endpoint 4 Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP5INT</name>
                     <description>Enable Endpoint 5 Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSUSP</name>
                     <description>Enable UDP Suspend Interrupt</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXRSM</name>
                     <description>Enable UDP Resume Interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTRSM</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOFINT</name>
                     <description>Enable Start Of Frame Interrupt</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKEUP</name>
                     <description>Enable UDP Bus Wakeup Interrupt</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDP_IDR</name>
               <description>Interrupt Disable Register</description>
               <addressOffset>0x014</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>EP0INT</name>
                     <description>Disable Endpoint 0 Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP1INT</name>
                     <description>Disable Endpoint 1 Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP2INT</name>
                     <description>Disable Endpoint 2 Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP3INT</name>
                     <description>Disable Endpoint 3 Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP4INT</name>
                     <description>Disable Endpoint 4 Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP5INT</name>
                     <description>Disable Endpoint 5 Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSUSP</name>
                     <description>Disable UDP Suspend Interrupt</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXRSM</name>
                     <description>Disable UDP Resume Interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTRSM</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOFINT</name>
                     <description>Disable Start Of Frame Interrupt</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKEUP</name>
                     <description>Disable USB Bus Interrupt</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDP_IMR</name>
               <description>Interrupt Mask Register</description>
               <addressOffset>0x018</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EP0INT</name>
                     <description>Mask Endpoint 0 Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP1INT</name>
                     <description>Mask Endpoint 1 Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP2INT</name>
                     <description>Mask Endpoint 2 Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP3INT</name>
                     <description>Mask Endpoint 3 Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP4INT</name>
                     <description>Mask Endpoint 4 Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP5INT</name>
                     <description>Mask Endpoint 5 Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSUSP</name>
                     <description>Mask UDP Suspend Interrupt</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXRSM</name>
                     <description>Mask UDP Resume Interrupt.</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTRSM</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOFINT</name>
                     <description>Mask Start Of Frame Interrupt</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BIT12</name>
                     <description>UDP_IMR Bit 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKEUP</name>
                     <description>USB Bus Wakeup Interrupt</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDP_ISR</name>
               <description>Interrupt Status Register</description>
               <addressOffset>0x01C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>EP0INT</name>
                     <description>Endpoint 0 Interrupt Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP1INT</name>
                     <description>Endpoint 1 Interrupt Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP2INT</name>
                     <description>Endpoint 2 Interrupt Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP3INT</name>
                     <description>Endpoint 3 Interrupt Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP4INT</name>
                     <description>Endpoint 4 Interrupt Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP5INT</name>
                     <description>Endpoint 5 Interrupt Status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSUSP</name>
                     <description>UDP Suspend Interrupt Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXRSM</name>
                     <description>UDP Resume Interrupt Status</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTRSM</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOFINT</name>
                     <description>Start of Frame Interrupt Status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDBUSRES</name>
                     <description>End of BUS Reset Interrupt Status</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKEUP</name>
                     <description>UDP Resume Interrupt Status</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDP_ICR</name>
               <description>Interrupt Clear Register</description>
               <addressOffset>0x020</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>RXSUSP</name>
                     <description>Clear UDP Suspend Interrupt</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXRSM</name>
                     <description>Clear UDP Resume Interrupt</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EXTRSM</name>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOFINT</name>
                     <description>Clear Start Of Frame Interrupt</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENDBUSRES</name>
                     <description>Clear End of Bus Reset Interrupt</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WAKEUP</name>
                     <description>Clear Wakeup Interrupt</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDP_RST_EP</name>
               <description>Reset Endpoint Register</description>
               <addressOffset>0x028</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>EP0</name>
                     <description>Reset Endpoint 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP1</name>
                     <description>Reset Endpoint 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP2</name>
                     <description>Reset Endpoint 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP3</name>
                     <description>Reset Endpoint 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP4</name>
                     <description>Reset Endpoint 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EP5</name>
                     <description>Reset Endpoint 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
