cmsis-svd/cmsis-svd/data/Microchip/ATSAMG55J.svd
            <register>
               <dim>6</dim>
               <dimIncrement>4</dimIncrement>
               <name>UDP_CSR[%s]</name>
               <description>Endpoint Control and Status Register 0</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXCOMP</name>
                     <description>Generates an IN Packet with Data Previously Written in the DPR</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_DATA_BK0</name>
                     <description>Receive Data Bank 0</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSETUP</name>
                     <description>Received Setup</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLSENT</name>
                     <description>Stall Sent</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXPKTRDY</name>
                     <description>Transmit Packet Ready</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FORCESTALL</name>
                     <description>Force Stall (used by Control, Bulk and Isochronous Endpoints)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_DATA_BK1</name>
                     <description>Receive Data Bank 1 (only used by endpoints with ping-pong attributes)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DIR</name>
                     <description>Transfer Direction (only available for control endpoints) (Read/Write)</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPTYPE</name>
                     <description>Endpoint Type (Read/Write)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>EPTYPESelect</name>
                        <enumeratedValue>
                           <name>CTRL</name>
                           <description>Control</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ISO_OUT</name>
                           <description>Isochronous OUT</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BULK_OUT</name>
                           <description>Bulk OUT</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT_OUT</name>
                           <description>Interrupt OUT</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ISO_IN</name>
                           <description>Isochronous IN</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BULK_IN</name>
                           <description>Bulk IN</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INT_IN</name>
                           <description>Interrupt IN</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DTGLE</name>
                     <description>Data Toggle (Read-only)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPEDS</name>
                     <description>Endpoint Enable Disable</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXBYTECNT</name>
                     <description>Number of Bytes Available in the FIFO (Read-only)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>6</dim>
               <dimIncrement>4</dimIncrement>
               <name>UDP_FDR[%s]</name>
               <description>Endpoint FIFO Data Register 0</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FIFO_DATA</name>
                     <description>FIFO Data Value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UDP_TXVC</name>
               <description>Transceiver Control Register</description>
               <addressOffset>0x074</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TXVDIS</name>
                     <description>Transceiver Disable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PUON</name>
                     <description>Pull-up On</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
