cmsis-svd/cmsis-svd/data/Microchip/ATSAMG55J.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>UHP</name>
         <version>6127G</version>
         <description>USB Host Port</description>
         <groupName>UHP</groupName>
         <prependToName>UHP_</prependToName>
         <baseAddress>0x4004C000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x5C</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>UHP</name>
            <value>47</value>
         </interrupt>
         <registers>
            <register>
               <name>UHP_HCREVISION</name>
               <description>OHCI Revision Number Register</description>
               <addressOffset>0x00</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>REV</name>
                     <description>OHCI revision number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCCONTROL</name>
               <description>HC Operating Mode Register</description>
               <addressOffset>0x04</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CBSR</name>
                     <description>Control/bulk service ratio</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PLE</name>
                     <description>Periodic list enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>IE</name>
                     <description>Isochronous enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLE</name>
                     <description>Control list enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLE</name>
                     <description>Bulk list enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>HCFS</name>
                     <description>Host controller functional state</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>IR</name>
                     <description>Interrupt routing</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWC</name>
                     <description>Remote wake-up connected</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RWE</name>
                     <description>Remote wake-up enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCCOMMANDSTATUS</name>
               <description>HC Command and Status Register</description>
               <addressOffset>0x08</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HCR</name>
                     <description>Host controller reset (read/write)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CLF</name>
                     <description>Control list filled (read/write)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BLF</name>
                     <description>Bulk list filled (read/write)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OCR</name>
                     <description>Ownership change request (read/write)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SOC</name>
                     <description>Scheduling overrun count (read-only)</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCINTERRUPTSTATUS</name>
               <description>HC Interrupt and Status Register</description>
               <addressOffset>0x0C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SO</name>
                     <description>Scheduling overrun (read/write, write '1' to clear)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDH</name>
                     <description>Write done head (read/write, write '1' to clear)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SF</name>
                     <description>Start of frame (read/write, write '1' to clear)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RD</name>
                     <description>Resume detected (read/write, write '1' to clear)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UE</name>
                     <description>Unrecoverable error (read/write, write '1' to clear)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FNO</name>
                     <description>Frame number overflow (read/write, write '1' to clear)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RHSC</name>
                     <description>Root hub status change (read/write, write '1' to clear)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC</name>
                     <description>Ownership change (read-only)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCINTERRUPTENABLE</name>
               <description>HC Interrupt Enable Register</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SO</name>
                     <description>Scheduling overrun (read/write, write '1' to set)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDH</name>
                     <description>Write done head (read/write, write '1' to set)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SF</name>
                     <description>Start of frame (read/write, write '1' to set)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RD</name>
                     <description>Resume detected (read/write, write '1' to set)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UE</name>
                     <description>Unrecoverable error (read/write, write '1' to set)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FNO</name>
                     <description>Frame number overflow (read/write, write '1' to set)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RHSC</name>
                     <description>Root hub status change (read/write, write '1' to set)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC</name>
                     <description>Ownership change (read-only)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MIE</name>
                     <description>Master interrupt enable (read/write, write '1' to set)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCINTERRUPTDISABLE</name>
               <description>HC Interrupt Disable Register</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SO</name>
                     <description>Scheduling overrun (read/write)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WDH</name>
                     <description>Write done head (read/write)</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SF</name>
                     <description>Start of frame (read/write)</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RD</name>
                     <description>Resume detected (read/write)</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>UE</name>
                     <description>Unrecoverable error (read/write)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>FNO</name>
                     <description>Frame number overflow (read/write)</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RHSC</name>
                     <description>Root hub status change (read/write)</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OC</name>
                     <description>Ownership change (read-only)</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MIE</name>
                     <description>Master interrupt enable (read/write)</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCHCCA</name>
               <description>HC HCCA Address Register</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>HCCA</name>
                     <description>Physical address of the beginning of the HCCA</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCPERIODCURRENTED</name>
               <description>HC Current Periodic Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>PCED</name>
                     <description>Physical address of the current ED on the periodic ED list</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCCONTROLHEADED</name>
               <description>HC Head Control Register</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CHED</name>
                     <description>Physical address of the head ED on the control ED list</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCCONTROLCURRENTED</name>
               <description>HC Current Control Register</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CCED</name>
                     <description>Physical address of the current ED on the control ED list</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCBULKHEADED</name>
               <description>HC Head Bulk Register</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BHED</name>
                     <description>Physical address of the head ED on the bulk ED list</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCBULKCURRENTED</name>
               <description>HC Current Bulk Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>BCED</name>
                     <description>Physical address of the current ED on the bulk ED list</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCDONEHEAD</name>
               <description>HC Head Done Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>DH</name>
                     <description>Physical address of the last TD that has added to the done queue</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>28</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCFMINTERVAL</name>
               <description>HC Frame Interval Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>FRAMEINTERVAL</name>
                     <description>Frame interval</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>FSMPS</name>
                     <description>Largest data packet</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>15</bitWidth>
                  </field>
                  <field>
                     <name>FIT</name>
                     <description>Frame interval toggle</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCFMREMAINING</name>
               <description>HC Frame Remaining Register</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FR</name>
                     <description>Frame remaining</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>FRT</name>
                     <description>Frame remaining toggle</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCFMNUMBER</name>
               <description>HC Frame Number Register</description>
               <addressOffset>0x3C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>FN</name>
                     <description>Frame number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCPERIODICSTART</name>
               <description>HC Periodic Start Register</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>PS</name>
                     <description>Periodic start</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCLSTHRESHOLD</name>
               <description>HC Low-Speed Threshold Register</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>LST</name>
                     <description>Low-speed threshold</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>UHP_HCRHDESCRIPTORA</name>
               <description>HC Root Hub A Register</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>NDP</name>
                     <description>Number of downstream ports (read-only)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
                  <field>
                     <name>PSM</name>
                     <description>Power switching mode (read/write)</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NPS</name>
                     <description>No power switching (read/write)</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DT</name>
                     <description>Device type (read-only)</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OCPM</name>
                     <description>Overcurrent protection mode (read/write)</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NOCP</name>
                     <description>No overcurrent protection (read/write)</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>POTPG</name>
                     <description>Power-on to power-good time (read/write)</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
